---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MEPSection.TotalCurveLength
source: html/809839ff-5f6f-e916-4fbd-2b16f0c38d29.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSection.TotalCurveLength Property

The total length of all segments in the section.

## Syntax (C#)
```csharp
public double TotalCurveLength { get; }
```

## Remarks
Default unit is Decimal feet.
 The unit type is UT_Length.